/*#include <iostream> //2. Даны действительные числа X, Y, Z. Определить среднее арифметическое и среднее геометрическое их модулей.

#include <iomanip> /*iomanip реализует инструменты для работы с форматированием вывода,
например базу, используемую при форматировании значений чисел.*/

/*
using namespace std; // пространство имен
int main() // возвращает значение
{
	system("color 5F"); //
	setlocale(LC_CTYPE, "Rus"); //функция позволяет выводить символы кириллицы
	float x, n;
	cout << "Введите, пожалуйста, диагональ квадрата:" << endl;
	cin >> x;

	n = sqrt(x) / 2;

	cout << "\nПлощадь квадрата равна:" << n;
	return 0; // возвращаем исходное значение 0, заканчиваем программу
}*/