/*		#include <iostream> //2. Даны действительные числа X, Y, Z. Определить среднее арифметическое и среднее геометрическое их модулей.

#include <iomanip> /*iomanip реализует инструменты для работы с форматированием вывода,
например базу, используемую при форматировании значений чисел.*/

/*
using namespace std; // пространство имен
int main() // возвращает значение
{
	system("color 5F"); //
	setlocale(LC_CTYPE, "Rus"); //функция позволяет выводить символы кириллицы
	float x, y, z, n, c;
	cout << "Введите, пожалуйста, число x:" << endl;
	cin >> x;
	cout << "Введите, пожалуйста, число y:" << endl;
	cin >> y;
	cout << "Введите, пожалуйста, число z:" << endl;
	cin >> z;

	n = (x + y + z) / 3;
	c = cbrt(x * y * z);

	cout << "\nСреднее арифметическое равно:" << n;
	cout << "\nСреднее геометрическое равно:" << c << endl;
	return 0; // возвращаем исходное значение 0, заканчиваем программу
}*/